# fonts
tap "homebrew/cask-fonts"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-hack"
cask "font-input"
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace-nerd-font"
cask "font-monaspace"

# emacs-plus
# https://github.com/d12frosted/homebrew-emacs-plus
tap "d12frosted/emacs-plus"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-savchenkovaleriy-big-sur-icon"]

# user home dir for brew install --cask
cask_args appdir: "~/Applications", require_sha: true
tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"

cask "1password-cli"
cask "alfred"
cask "bartender"
cask "bbedit"
cask "gpg-suite"
cask "kaleidoscope"
cask "mailmate"
cask "netnewswire"
cask "omnifocus"
cask "slack"
cask "spamsieve"
cask "the-unarchiver"
cask "visual-studio-code"
cask "xcodes"

brew "azure-cli"
brew "certbot"
brew "direnv"
brew "docker"
brew "exa"
brew "exiftool"
brew "ffmpeg"
brew "gh"
brew "htop"
brew "hugo"
brew "iperf3"
brew "jenv"
brew "jq"
brew "just"
brew "llvm"
brew "mosh"
brew "pyenv-virtualenv"
brew "pyenv"
brew "ripgrep"
brew "rustup-init"
brew "starship"
brew "stow"
brew "tmux"
brew "watch"
brew "wget"
brew "xz"
